import axios from "axios";

// const send = async (url, data) => {
//   try {
//     const response = await (data
//       ? axios.post(`http://localhost:8080/api/${url}`, data, {
//           withCredentials: true
//         })
//       : axios.get(`http://localhost:8080/api/${url}`, {
//           withCredentials: true
//         }));

//     return response.data;
//   } catch (err) {
//     return err.response;
//   }
// };
const Ideas = [
  {
    id: 1,
    number: 112,
    title: "לא לראות וליפול",
    about:
      "בדרך כלל זה לא קל להיות עיוור, אבל ניתן להשתמש במקל וזה ידוע, מה עם כל הנפילות שנגרמות בגלל המיקל?, אז לפתור את העיה נראה לי כדאי לייצר קופסא שהינה אחראית כגון עבודת המקל."
  }
];
const newProject = [
  {
    id: 1,
    number: 112,
    title: "גרייס&סהיר",
    author: "גרייס זאמל ,סהיר יעקובי",
    supervisor: "ד”ר מלכי גרוסמן",
    about: "פרויקטים לבעלי מוגבלות",
    youtubeUrl: "https://www.youtube.com/embed/6r7-oD5CMlM"
  }
];
const searchProject = [
  {
    id: 6,
    number: 112,
    title: "מדרגות שיקום – עולים, יורדים ומתחזקים",
    author: "אמיר משה ונתנאל לוי",
    supervisor: "ד”ר אורית בראון בנימין",
    about:
      "את המאמר הבא נפתח בנתון מעניין:  כ-30% מבני ה-65  ומעלה מדווחים על נפילות בסביבת מגוריהם לפחות פעם בשנה.נפילות, בעיקר בקרב מבוגרים, טומנות בחובן משמעויות והיבטים לא פשוטים, פיזיים ורגשיים כאחד. אדם מבוגר שנופל – גם כשלעומד מן הצד זה יכול להראות כמו עוד מעידה קטנה – עלול לשבור את מפרק הירך או עצם אחרת, לעבור ניתוח לקיבוע השבר/החלפת מפרק, וכן תהליך שיקום מייגע שבסופו הוא עלול להפוך לסיעודי.לדוגמא, מתברר ששבר בצוואר הירך הוא ממובילי הסיבות לתמותה בקרב קשישים: כ-20%-25% מהנפגעים נפטרים בשנה הראשונה לאחר השבר; כ-25% נוספים הופכים לסיעודיים, ו- 25% אחרים נותרים עם מגבלה תפקודית כל שהיא. במלים אחרות: רק כרבע מהנפגעים יחזרו לתפקוד מלא לאחר אירוע שבר מסוג זה.",
    youtubeUrl: "https://www.youtube.com/embed/1Web_0_E9zM"
  },
  {
    id: 15,
    number: 112,
    title: "מערכת לשינוע עצמי",
    author: "גיא קנטור",
    supervisor: "מר נצר נבות, ד”ר אורית בראון בנימין",
    about:
      "הפגם הגנטי המולד של מוחמד הביא לקריסת מערכתו החיסונית, והוא רק בן ארבע. לצערנו, מקרים כמו של מוחמד אינם חדשים בעולם הרפואה. מוחמד נולד בחאן יונס שבעזה וכבר בגיל חצי שנה הועבר לישראל לבית החולים לילדים בתל השומר לטובת טיפול רפואי. במהלך שהותו בבית החולים תל השומר התגלתה במערכת העיכול של מוחמד מחלה נדירה אשר גרמה להדרדרות מצבו לכדי סכנת חיים. כחלק מהמאמצים להצלת חייו של מוחמד נאלצו הרופאים לקטוע ארבע מגפיו מתחת למפרק.  העובדה שמוחמד הוא תושב עזה אשר מטופל בישראל עקב מצבו הבריאותי הרגיש, מוסיפה למקרה נופך ייחודי, אך ייחודיות זו מולידה מורכבות רבה, מורכבות אשר עמה, גיא קנטור, בוגר המחלקה להנדסת מכונות באורט בראודה, ידע להתמודד בהצלחה כאשר נדרש לתכנן מערכת ניוד מותאמת לצרכיו של מוחמד וזאת על מנת לקדם את שיקומו ולהקנות לו סיכוי לחיים נורמטיביים ועצמאיים ככל הניתן.",
    youtubeUrl: "https://www.youtube.com/embed/WMahf9HjWTA"
  }
];
const shProject = [
  {
    id: 2,
    number: 112,
    title: "מתקן לניהוג כיסא גלגלים ידני ביד אחת",
    author: "יניב קסטיאל ושמואל לוי",
    supervisor: " ד”ר אורית בראון בנימין",
    about:
      "עוד פרוייקט מרגש מבית היוצר של המכללה. הפעם מדובר בכיסא גלגלים ייחודי שתוכנן עבור יורי, קשיש מבית האבות “בראט” בכרמיאל, שעבר אירוע מוחי ונותר משותק בפלג גופו התחתון ובצד שמאל. הסטודנטים, יניב קסטיאל ושמואל לוי, שנה רביעית בהנדסת מכונות, תכננו עבורו כסא גלגלים שמאפשר לו לנוע באופן עצמאי באמצעות הפעלת יד אחד בלבד. אחרי חודשים רבים של עבודה וניסיונות הביאו הסטודנטים את כיסא הגלגלים ליורי, והסרטון הבא מביא את סיפורו של המפגש המרגש. הפרויקט נעשה במסגרת הקורס: ביומכניקה שיקומית, בהנחיית ד”ר אורית בראון-בנימין.",
    youtubeUrl: "https://www.youtube.com/embed/WhxBKzDTR4g"
  },
  {
    id: 11,
    number: 112,
    title: "סד אלסטי לתמיכה בשורש כף היד",
    author: "אורי וולוביץ’",
    supervisor: " ד”ר אורית בראון בנימין",
    about:
      " סטודנטים בקורס תכן הנדסי יצרו עבור עופר ג’אן, נכה בארבע גפיים,  סד ייחודי  ואלסטי, שאמור לתמוך בשורש כף היד שלו ולאפשר לו לבצע תנועה בכף ידו שאיננה משותקת. אמצעות הסד עופר יוכל מעתה לצחצח שיניים ולחתום את שמו, וחייו יהיו פשוטים וקלים יותר. הסרטון הבא מספר על הפרויקט ומפגיש את עופר עם אחד הסטודנטים שהכינו עבורו את הסד.",
    youtubeUrl: "https://www.youtube.com/embed/5Cv93XcHnU0"
  }
];
const Projects = [
  {
    id: 3,
    number: 112,
    title: "עמדת לגרייה חושית",
    author: " אמין טאריף ונאג’י חטיב",
    supervisor: " אורית הבראון בנימין",
    about:
      "כ 8-10 מהדיירים במחלקה הסיעודית של בית האבות מקבלים “גרייה חושית” ע”י מדריכת התעסוקה. גרייה חושית נעשית באמצעות אביזרים שונים. המתקן שתוכנן, פותח ונבנה על ידי הסטודנטים אמין טאריף ונאג’י חטיב, צריך להכיל את האביזרים השונים, להתכוונן (בגובה) בזויות, ובמפתח, כך שיהיה נגיש למטופל בצורה מלאה (בשכיבה, בישיבה בכסא גלגלים או בכורסא גריאטרית). המתקן הינו נייד ומאפשר אחסון בחדר ריפוי בעיסוק. מחמוד שנען, מסגר במקצועו, מהכפר ג’וליס, התנדב ותרם מזמנו וממרצו כדי לסייע לסטודנטים להשלים את משימתם על הצד הטוב ביותר.  תודת המכללה נתונה לו.",
    youtubeUrl: "https://www.youtube.com/embed/NbOlnzVrVeI"
  },

  ,
  {
    id: 5,
    number: 112,
    title: "ירוק בעיניים: על הגינות הטיפוליות",
    author: " יגאל מוגילבסקי ומתן יפרח",
    supervisor: " אורית הבראון בנימין",
    about:
      " ינון טיפולי לאוכלוסייה הבוגרת, עושה שימוש בפעילויות שונות הקשורות בגינות וטיפוח גנים לשם טיפול בהיבטים הפיזיים והנפשיים של אוכלוסייה זו. במהלך החיים ישנם שינויים רבים, הבאים לידי ביטוי בהתנהלות היומיומית והסביבתית. שינויים אלו, משפיעים באופן ישיר על המצב הבריאותי הפיזי והנפשי של האדם, ובפרט על הקשיש. אחת הדרכים המעניינות לחיזוק של מערכות אלו בגוף, הינה באמצעות גינון טיפולי, המהווה חוויה נעימה ותורמת לאוכלוסיית הקשישים.הפרויקט שלפניכם כולל  הקמת עמדות גינון מתכוונות עבור דיירים ניידים, דיירים המשתמשים בכיסאות גלגלים ודיירים המשתמשים בכורסאות גריאטריות. עד כה נבנו שלושה שולחנות כאלה. השולחנות כוללים ארונית אחסון לכלי הגינה, כלי גינה עם מחברים המותאמים לשימוש בעת ישיבה בכיסא גלגלים, ושני אמצעי השקיה.  המתקנים ישרתו כ- 15-20 מדיירי הבית.בעת מסירת המתקנים בוצעה שתילה של צמחים ע”י אחת מדיירות הבית. הדיירת הביעה שביעות רצון רבה מהעמדה.",
    youtubeUrl: "https://www.youtube.com/embed/RKcIUADA7Eg"
  },
  //   <iframe width="560" height="315" src="https://www.youtube.com/embed/1Web_0_E9zM" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
  {
    id: 7,
    number: 112,
    title: "סטטוסקופ אלקטרוני ללב ולריאות",
    author: " דימה בלנובסקי ומיכאל מודילבסקי",
    supervisor: " מר שמעון פיטלסון",
    about:
      "מקצועות חופשיים רבים מאופיינים בכלי עבודתם. כמו שהפטיש בבית הדין מקושר לדיין והמחבת לטבח, כך גם הסטטוסקופ, או תרצו, המָסְכֶּת, מיוחס לרופא. מי שביקר מימיו בבית חולים וודאי היה עד למחזה של האיש בחלוק הלבן אשר לצווארו סטטוסקופ. נוכחותו של הסטטוסקופ, שפותח לראשונה לפני כ-150 שנים וכמעט לא השתנה מאז, איננה מובנת מאליה בעידן שבו ההתפתחויות הטכנולוגיות בעולם הרפואה הן חסרות תקדים; חשיבותו ככלי עזר לרופא, נותרה בעינה ולא בכדי רופאים מקפידים להסתובב איתו כשהוא תלוי על צווארם, “מתהדרים” בו כבמעין סמל סטטוס. חשיבותו נובעת מכך שבבדיקה פשוטה הסטטוסקופ פותח לרופא צוהר לקולות הרוחשים בגופו של המטופל ונותן לו מושג ראשוני וחיוני על מצבו.",
    youtubeUrl: "https://www.youtube.com/embed/WhxBKzDTR4g"
  },
  ,
  {
    id: 8,
    number: 112,
    title: "סורק בלחיצת כפתור בלבד",
    author: "איתי  הורוביץ",
    supervisor: "שמעון סיגלר",
    about:
      " הסטודנט איתי הורוביץ, תלמיד בקורס “ביומכניקה שיקומית” במכללה, הגה פתרון יצירתי להפעלת סורק באמצעות יד אחת בלבד. הרעיון נולד לאחר שמשתקמת במרכז מארג, משותקת ביד ימין שלה, העלתה בפניו את הקושי שלה לסרוק תמונות ובו-זמנית גם להפעיל את תכנת הסריקה באמצעות העכבר. הסטודנט לקח סורק קיים, עשה בו התאמות ולמעשה הפך אותו למוצר ייחודי שמאפשר לסרוק באמצעות לחיצה על כפתורי הפעלה וללא הצורך להרים את מכסה הסורק באופן ידני.",
    youtubeUrl: "https://www.youtube.com/embed/PVJIsGPzd4E"
  },
  ,
  {
    id: 9,
    number: 112,
    title: "מסור דו-צדדי מותאם לעבודת נכים",
    author: "טל  מילר ושגיא דואק",
    supervisor: "ד”ר אורית בראון בנימין",
    about:
      "הסטודנטים טל מילר ושגיא דואק פיתחו מסור ייחודי עבור מרכז השיקום מארג בכפר ורדים. המסוק פותח לאחר שהתברר שישנם משתקמים שאינם יכולים להשתתף בסדנת הנגרות משום שגובה עמדת העבודה והמסור לא מתאימים למי שאינם מסוגלים לעמוד. המסור שתופח על ידי הסטודנטים מיועד לעבודה בזוגות, לאחר שהוסיפו לו ידית אחיזה גם בצדו השני והתאימו את הזווית כך שנכה שיושוב על כסא גלגלים יכול לקחת חלק בעבודת הניסור ללא מאמץ.",
    youtubeUrl: "https://www.youtube.com/embed/z5eFIiTeqMg"
  },
  {
    id: 10,
    number: 112,
    title: "מכונת צביעה חשמלית",
    author: "ולנטין נוביקוב והלל עברי",
    supervisor: "ד”ר אורית בראון בנימין",
    about:
      "שיתוף הפעולה בין מרכז מארג בכפר ורדים, שמשקם בעלי מוגבלויות באמצעות פעילויות שונות, בפרט בתחום האמנותי, לבין סטודנטים להנדסת מכונות במכללה, נמשך גם השנה, והוא כבר הוליד לא מעט פתרונות הנדסיים שמקלים את חייהם של בעלי מוגבלויות שונות. אחד הפתרונות הללו נעשה עבור חוסה במוסד, שמשתתפת בסדנת קרמיקה ומתקשה לבצע את משימת הצביעה בגלל שיתוק המוחין שממנו היא סובלת ובעטיו גם ממגבלה מוטורית קשה בגפיים.",
    youtubeUrl: "https://www.youtube.com/embed/CVQrxDNbfZo"
  },
  {
    id: 11,
    number: 112,
    title: "סד אלסטי לתמיכה בשורש כף היד",
    author: "אורי וולוביץ’",
    supervisor: " ד”ר אורית בראון בנימין",
    about:
      " סטודנטים בקורס תכן הנדסי יצרו עבור עופר ג’אן, נכה בארבע גפיים,  סד ייחודי  ואלסטי, שאמור לתמוך בשורש כף היד שלו ולאפשר לו לבצע תנועה בכף ידו שאיננה משותקת. אמצעות הסד עופר יוכל מעתה לצחצח שיניים ולחתום את שמו, וחייו יהיו פשוטים וקלים יותר. הסרטון הבא מספר על הפרויקט ומפגיש את עופר עם אחד הסטודנטים שהכינו עבורו את הסד.",
    youtubeUrl: "https://www.youtube.com/embed/5Cv93XcHnU0"
  },
  {
    id: 12,
    number: 112,
    title: "ההליכון של רינת",
    author: "יהודה פורר ואנדרי דרזדוב",
    supervisor: "ד”ר אורית בראון בנימין",
    about:
      "הסטודנטים יהודה פורר ואנדרי דרזדוב, בוגרי המחלקה להנדסת מכונות והקורס לתכן הנדסי, הצליחו לתכנן הליכון אחור ייחודי שעשוי לסייע לאלפי בעלי מוגבלויות לצורך התניידות יום-יומית. כיום, ההליכונים שקיימים בשוק מחייבים שימוש בשתי ידיים על מנת לקפלם ולפתחם בכל פעם מחדש, אלא שנכים רבים, בפרט אלה שסובלים משיתוק מוחין ,שמגביל מאוד את גמישותם ואת תנועת הגפיים שלהם, מתקשים לעשות זאת, משום שעל פי רוב רק יד אחת אצלם דומיננטית, והשניה כמעט שאיננה פעילה. ההליכון שתכננו הסטודנטים פועל בשיטה שמצריכה הפעלת יד אחת בלבד.  הסרטון שלפניכם מציג את האב-טיפוס שהסטודנטים הכינו  ואת  המפגש שלהם עם מי שלמעשה ביקשה את המתקן,  עו”ד רינת ברוך, שסובלת משיתוק מוחין.",
    youtubeUrl: "https://www.youtube.com/embed/wpYIAK3Ovf8"
  },
  {
    id: 13,
    number: 112,
    title: "מתקן ייחודי להרמת חפצים מהרצפה",
    author: "נבות זיו",
    supervisor: " ד”ר אורית בראון בנימין",
    about:
      "נבות זיו, בוגר הקורס תכן הנדסי  של המחלקה להנדסת מכונות הגה במסגרת פרויקט הגמר שלו מתקן מיוחד, שמאפשר לנכים שלא מסוגלים להתכופף, להרים חפצים שונים מהרצפה (בקבוקי שתיה, ניירות וכיו”ב). את הפרוייקט הוא עשה נבות עבור חן וקנין, נערה שלומדת בבית הספר הפתוח בתפן. בסרטון הבא מנסה חן להשתמש בפעם הראשונה במתקן. האם זה יעבוד ? כדי לדעת את התשובה תצטרכו לצפות בסרט עצמו.",
    youtubeUrl: "https://www.youtube.com/embed/nwvTYUyqElo"
  },
  {
    id: 14,
    number: 112,
    title: "’הפתרון שמאפשר לכ-ו-ל-ם לשתות מה’קולר",
    author: " אורטל אלפרסון",
    supervisor: "ד”ר אורית בראון בנימין",
    about:
      "מי מאתנו לא נתקל במרוצת חייו ב”קולר” (Cooler), אותה עמדת שתייה, שמרווה את צמאוננו ומשפריצה על פנינו מים צוננים כל אימת שאנו לוחצים על הכפתור שנועד לשחרר את המים ישירות לפינו ? שהרי ההשפרצה חסרת המעצורים הזאת היא “נשמת אפו” של ה’קולר’, סלע קיומו, ועל כן גם מתקבלת בחיוך רטוב. אבל יש כאלה שלא חוו את החוויה המרעננת והמרנינה הזאת, לא כי הם לא רוצים, אלא כי הם לא מסוגלים. חנה זיסקינד, צעירה שסובלת משיתוק מוחין (CP), היא אחת כזאת. מבחינתה ה’קולר’  היה עד לאחרונה מחוץ לתחום ההשגה. כדי לשתות ממימיו היה עליה למלא בקבוק ובגלל מוגבולתה הגופנית ומבנה ה’קולר’ שדורש לחיצה עקבית ואחידה על כפתור ההתזה – היתה זאת עבורה משימה בלתי אפשרית. עד שבאה אורטל אלפרסון, בוגרת המחלקה להנדסת מכונות במכללה, ופתרה לה את הבעיה במסגרת הקורס ביומכניקה שיקומית. הרעיוןן פשוט: היא הצליחה לתכנן ולייצר מתקן עזר למילוי בקבוק  על ידי הפעלת יד אחת בלבד.",
    youtubeUrl: "https://www.youtube.com/embed/zV4BxfT3380"
  }
];
const Categories = [
  {
    id: 1,
    number: 112,
    title: "חיפוש פרויקטים לפי תחומים",
    imgSrc: "byFaculty.png"
  },
  {
    id: 2,
    number: 112,
    title: 'חיפוש פרויקטים לפי א"ב',
    imgSrc: "byABC.png"
  },
  {
    id: 3,
    number: 112,
    title: "פרויקטים מומלצים",
    imgSrc: "recommended.png"
  },
  {
    id: 4,
    number: 112,
    title: "פרויקטים חדשים",
    imgSrc: "new.png"
  },
  {
    id: 5,
    number: 112,
    title: "פרויקטים בתקופת נסיון",
    imgSrc: "exp.png"
  }
];
const Files = [
  { img: "pdf.png", name: "Project Book.pdf" },
  { img: "pptx.png", name: "Final Presentation.pptx" },
  { img: "matlab.jpg", name: "Project Matlab.m" },
  { img: "xlsx.png", name: "Statistics.xlsx" }
];

const Roles = [{ description: "asd", id: 1, name: "admin" }];
class Api {
  // addNewProject(value) {
  //   const {
  //     name,
  //     description,
  //     startDate,
  //     technicalSkill,
  //     productSkill
  //   } = value;
  //   const newProject = await axios.post(
  //     `${url}projects`,
  //     {
  //       name: name,
  //       description: description,
  //       startDate: startDate,
  //       technicalSkill: technicalSkill,
  //       productSkill: productSkill
  //     },
  //     { withCredentials: true }
  //   );
  //   return newProject;
  // }

  getSearch() {
    return searchProject;
  }
  getProjects() {
    return Projects;
  }
  getSearchProjects() {
    return shProject;
  }
  getFiles() {
    return Files;
  }
  getnewProjects() {
    return newProject;
  }
  getCategories() {
    return Categories;
  }
  getRoles() {
    return Roles;
  }
  getProjectsByID(projectID) {
    Projects.filter(project => {
      return project.id == projectID;
      // if (project.id == projectID) {
      //   // console.log(project)
      //   return project;
      // }
    });
  }
  getCategoriesByID(categoryID) {
    Categories.filter(category => {
      return category.id == categoryID;
      // if (project.id == projectID) {
      //   // console.log(project)
      //   return project;
      // }
    });
  }
  getIdeasByID(ideaID) {
    Projects.filter(idea => {
      return idea.id == ideaID;
      // if (project.id == projectID) {
      //   // console.log(project)
      //   return project;
      // }
    });
  }
}
export default new Api();
